contrib-imola/cics-bc/jbi4cics/src/test/resources/xmlmessages/testNestedMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:it.imolinfo.jbi4cics.test.webservices.utils.generators" xmlns:gen="http://generators.utils.webservices.test.jbi4cics.imolinfo.it">
   <soapenv:Body>
      <urn:provaNestedOperation>
         <urn:in0>
            <!--Optional:-->
            <gen:CA_RETCODE1>Hello</gen:CA_RETCODE1>
            <!--Optional:-->
            <gen:CA_RETCODE2>
               <!--Optional:-->
               <gen:CA_RETCODE3>Hola</gen:CA_RETCODE3>
            </gen:CA_RETCODE2>
            <!--Optional:-->
            <gen:CA_RETCODE4>Ciao</gen:CA_RETCODE4>
         </urn:in0>
      </urn:provaNestedOperation>
   </soapenv:Body>
</soapenv:Envelope>